Revit 2027 API
BuiltInFailures.CurtainGridFamilyFailures.CannotCreateCurtainPanelInOpeningWarning Property
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateCurtainPanelInOpeningWarning { get; }
Public Shared ReadOnly Property CannotCreateCurtainPanelInOpeningWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateCurtainPanelInOpeningWarning {
	FailureDefinitionId^ get ();
}
static member CannotCreateCurtainPanelInOpeningWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainGridFamilyFailures Class
Autodesk.Revit.DB Namespace